{
  "antiPatterns": [
    {
      "name": "Megaservice",
      "aliases": [
        "Multiservice",
        "The God Object",
        "God Object Web Service",
        "Big Ball of Mud"
      ],
      "description": "A service that implements many methods for multiple business and technical abstracts. It should should be decomposed into smaller services or microservices.",
      "context": "",
      "detection": "Typically a Megaservice is a single service exposing a large number of public interface methods which support lots of functionality for different entities which might not be closely related to each other.",
      "consequences": "The service has a large number of methods which include multiple core abstractions or multiple data types that are exchanged. There are only a few or possibly only one service within the system which has to handle all the processes. This also means that multiple developers will maintain and therefore, modify the same service concurrently. Any changes to the service's interface result in rebuilding and redeploying a number of other services which use this interface. Since the number of methods and interactions in a Megaservice is very large, unit testing such a service becomes very time consuming due the dependencies within the service. The size and complexity of the a Megaservice can also mean that deploying the service needs special configuration.",
      "cause": "The requirements might be nonexistent or poorly structured making it very hard to identify their abstractions. Often patterns are used when designing the services which might lead to antipatterns when misunderstood or wrongly applied. One of such patterns is the Session Facade pattern which can lead to a Megaservice when misunderstood. Instead of misunderstood patterns the designer of the service could have also misunderstood the principles of high cohesion and low coupling or not applied them at all, resulting in a Megaservice as well.",
      "solution": "The service's inappropriate methods need to be extracted to new interfaces.",
      "example": "A service, implementing methods for ordering, paying and shipping and order.",
      "sources": [
        "@article{taibi2018definition, title={On the Definition of Microservice Bad Smells}, author={Taibi, Davide and Lenarduzzi, Valentina}, journal={IEEE software}, volume={35}, number={3}, pages={56--62}, year={2018}, publisher={IEEE}, doi={10.1109/ms.2018.2141031}}",
        "@book{dudney2003j2ee, title={J2EE antipatterns}, author={Dudney, Bill and Asbury, Stephen and Krozak, Joseph K and Wittkopf, Kevin}, year={2003}, publisher={John Wiley \\& Sons}}",
        "@article{ouni2017search, author={A. Ouni and M. Kessentini and K. Inoue and M. {\\'O}. Cinn{\\'e}ide}, journal={IEEE Transactions on Services Computing}, title={Search-Based Web Service Antipatterns Detection}, year={2017}, volume={10}, number={4}, pages={603--617}, doi={10.1109/TSC.2015.2502595}, ISSN={1939-1374}, month={July},}",
        "@article{Palma2014b, author={Palma, Francis and Moha, Naouel and Tremblay, Guy and Gu{\\'e}h{\\'e}neuc, Yann-Ga{\\\"e}l}, doi = {10.1007/978-3-319-09970-5_6}, isbn = {9783319099699}, issn = {16113349}, journal = {Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)}, pages = {58--73}, title = {{Specification and detection of SOA antipatterns in web services}}, volume = {8627 LNCS}, year = {2014}}",
        "@inproceedings{ouni2015web, author = {Ouni, Ali and Gaikovina Kula, Raula and Kessentini, Marouane and Inoue, Katsuro}, title = {Web Service Antipatterns Detection Using Genetic Programming}, booktitle = {Proceedings of the 2015 Annual Conference on Genetic and Evolutionary Computation}, series = {GECCO '15}, year = {2015}, isbn = {978-1-4503-3472-3}, location = {Madrid, Spain}, pages = {1351--1358}, numpages = {8}, url = {http://doi.acm.org/10.1145/2739480.2754724}, doi = {10.1145/2739480.2754724}, publisher = {ACM}, address = {New York, NY, USA}}",
        "@inproceedings{nayrolles2013improving, title={Improving SOA antipatterns detection in Service Based Systems by mining execution traces}, author={Nayrolles, Mathieu and Moha, Naouel and Valtchev, Petko}, booktitle={Reverse Engineering (WCRE), 2013 20th Working Conference on}, pages={321--330}, year={2013}, doi={10.1109/WCRE.2013.6671307}}",
        "@inproceedings{palma2015study, title={A study on the taxonomy of service antipatterns}, author={Palma, Francis and Mohay, Naouel}, booktitle={Patterns Promotion and Anti-patterns Prevention (PPAP), 2015 IEEE 2nd Workshop on}, pages={5--8}, year={2015}, doi={10.1109/PPAP.2015.7076848}}"
      ],
      "tags": [
        "architecture", "system", "service", "many_methods", "low_cohesion"
      ],
      "relatedItems": [
      ]
    }
  ]
}

