{
  "antiPatterns": [
    {
      "name": "Overstandardized SOA",
      "aliases": [
        "Standardization Paralysis",
        "Vendor-Lock-In"
      ],
      "description": "In SOA there is a tendency to overstandardize the technical domain resulting in many SOA standards and adding additional complexity.",
      "context": "Standardization is a useful part of any technical domain but most commonly SOA standards are set by large software vendors.",
      "detection": "",
      "consequences": "There are many (interdependent) standards that have to be introduced, updated and maintained constantly. Since most commonly these standards are set by large software vendors, the culture of large enterprises is (unintentionally) applied. Users of the standard are also depending on its vendor since the changes that are made to support it are typically very large.",
      "cause": "Tendency to standardize all the technical aspects and dimensions of SOA. Especially since XML enables an easy transformation of languages to standards.",
      "solution": "Reduce standards to SOA aspects where they have the greatest effect which can be done by using coarse-grained user knowledge domain oriented interfaces. Vendors should also first specify local standards and assess whether they are useful and based on that publish them as public ISO standards or discard them.",
      "example": "",
      "sources": [
        "@inproceedings{kral2009popular,author={Kr{\\'a}l, Jaroslav and {\\v{Z}}emlicka, Michal},booktitle={2009 Computation World: Future Computing, Service Computation, Cognitive, Adaptive, Content, Patterns},title={Popular SOA Antipatterns},year={2009},pages={271-276},doi={10.1109/ComputationWorld.2009.80},month={Nov}}",
        "@inproceedings{kral2007most,author={Kral, Jaroslav and Zemlicka, Michal},booktitle={International Conference on Software Engineering Advances (ICSEA 2007)},title={The Most Important Service-Oriented Antipatterns},year={2007},pages={29--29},doi={10.1109/ICSEA.2007.74},month={Aug}}"
      ],
      "tags": [
        "soa",
        "architecture"
      ],
      "relatedItems": [
        {
          "relation": "relates",
          "name": "No Legacy"
        },
        {
          "relation": "follows",
          "name": "Nanoservices"
        }
      ]
    }
  ]
}
