{
  "antiPatterns": [
    {
      "name": "Service Chain",
      "aliases": [
        "Percolating Process"
      ],
      "description": "This antipattern describes a chain of service calls which is needed to fulfill goals of the services.",
      "context": "Multiple services that call each other to fulfill their goals.",
      "detection": "",
      "consequences": "",
      "cause": "The organisation has decided to map the processes and end to end and in detail; the work has created a series of grand \"end to end\" process models that are categorised by their large number of steps and the lack of sub-processes that they use. Once this exercise has been done to a great level of detail it is decided to make it SOA. The problem is that the valid business services have not been identified and thus the process maps have been created without a proper service structure. This makes identifying valid services a tricky process particularly when looking for cross-functional or horizontal services.",
      "solution": "The first resolution is to independently of the process map create your services architecture. This will provide the structure for breaking down the processes and creating a clear hierarchy of use. Next, this service architecture should be over-laid onto the process map to understand where the cuts should be made. The current solutions can then be refactored to create a more service oriented solution by attacking the major inflexibilities in the system and then looking towards incremental change of the current systems.",
      "example": "",
      "sources": [
        "@inproceedings{nayrolles2013improving, title={Improving SOA antipatterns detection in Service Based Systems by mining execution traces}, author={Nayrolles, Mathieu and Moha, Naouel and Valtchev, Petko}, booktitle={Reverse Engineering (WCRE), 2013 20th Working Conference on}, pages={321--330}, year={2013}, doi={10.1109/WCRE.2013.6671307}}",
        "@misc{Jones2006, title = {{SOA anti-patterns}}, year = {2006}, booktitle = {InfoQ}, author = {Jones, Steve}, url = {https://www.infoq.com/articles/SOA-anti-patterns} }"
      ],
      "tags": [
        "microservices",
        "soa",
        "architecture",
        "system",
        "dependency"
      ],
      "relatedItems": [
        {
          "relation": "relates",
          "name": "Chatty Service"
        },
        {
          "relation": "precedes",
          "name": "Wrong Cuts"
        }
      ]
    }
  ]
}
